---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.UnjoinedRoomSeparationLinesFound
source: html/f6225ba1-9429-72a3-1bde-d3c5b3e468e6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.UnjoinedRoomSeparationLinesFound Property

Room Separation of <element> is not joined, might cause performance issue with room boundaries computations.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnjoinedRoomSeparationLinesFound { get; }
```